# Criando um Data Frame do zero

##  importando pandas como pd

In [14]:
import pandas as pd

## criando um data frame

In [15]:
idade_personagens = pd.DataFrame({ 'Personagem': ['Cloud', 'Tifa', 'Barret', 'Aerith', 'Vincent',
                                                   'Yuffie', 'Cid', 'Red XIII', 'Cait Sith'],
                                   'Idade': [21, 20, 35, 22, 57, 16, 32, 48, 'N/A']})

In [16]:
idade_personagens

  Personagem Idade
0      Cloud    21
1       Tifa    20
2     Barret    35
3     Aerith    22
4    Vincent    57
5     Yuffie    16
6        Cid    32
7   Red XIII    48
8  Cait Sith   N/A

##  sort_values(by=[ 'Column name' ]) ( ascending=False pode ser usado)

In [17]:
idade_personagens.sort_values(by=['Personagem'])

  Personagem Idade
3     Aerith    22
2     Barret    35
8  Cait Sith   N/A
6        Cid    32
0      Cloud    21
7   Red XIII    48
1       Tifa    20
4    Vincent    57
5     Yuffie    16

## Mudando o nome de uma coluna

In [20]:
idade_personagens = idade_personagens.rename(columns={'Personagem': 'Nome'})

In [21]:
idade_personagens

        Nome Idade
0      Cloud    21
1       Tifa    20
2     Barret    35
3     Aerith    22
4    Vincent    57
5     Yuffie    16
6        Cid    32
7   Red XIII    48
8  Cait Sith   N/A